import exampleBookImage from "../assets/images/exampleBook.png";
import exampleProfileImage from "../assets/images/profile-image.png";

export const bookList = [
    {
        bookId: 1,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {   
        bookId: 2,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {
        bookId: 3,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {   
        bookId: 4,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {   
        bookId: 5,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {   
        bookId: 6,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    {   
        bookId: 7,
        title: "생활코딩! React 리액트 프로그래밍",
        price: 25000,
        author: "이고잉",
        image: exampleBookImage,
        publicationDate: "2023-02-22",
        publisher: "위키북스",
        salePrice: 12500,
        category: "컴퓨터/IT",
        isbn: "9791158392233",
    },
    
];

export const postList = [
    {   
        image: exampleBookImage,
        title: "부는 어디서 오는가",
        content: "1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안  ",
    },
    {   
        image: exampleBookImage,
        title: "부는 어디서 오는가",
        content: "1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안  ",
    },
    {   
        image: exampleBookImage,
        title: "부는 어디서 오는가",
        content: "1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안  ",
    },
    {   
        image: exampleBookImage,
        title: "부는 어디서 오는가",
        content: "1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안  ",
    },
    {   
        image: exampleBookImage,
        title: "부는 어디서 오는가",
        content: "1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안 1910년 오리지널 초판본 디자인 100년 동안 단 1%만 알았던 부의 법칙 “특정한 방식으로 생각하고, 행동하라” *** 아마존 베스트셀러 최장기 1위 *** *** 전 세계 1억 3천만 부 판매 *** *** 수백만 명의 삶을 바꾼 책 *** “신은 당신을 돕지 않을 수 없다. 신 자신을 위해서라도 그렇게 해야만 하기 때문이다.” 출간 후 백 년이 넘는 기간 동안  ",
    },
    
]

export const userInfo =
    {
        userId: 1204,
        name: "한승규",
        image: exampleProfileImage,
    }
